tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4525_tdd.h
#define SEN                           522
#define RSEN                          523
#define PEN                           524
#define RCEN                          525
#define ACKEN                         526
#define ACKDT                         527
#define ACKSTAT                       528
#define GCEN                          529
#define SSPCON1                       530
#define SSPM0                         531
#define SSPM                          532
#define SSPM1                         533
#define SSPM2                         534
#define SSPM3                         535
#define CKP                           536
#define SSPEN                         537
#define SSPOV                         538
#define WCOL                          539
#define SSPSTAT                       540
#define BF                            541
#define UA                            542
#define R_NOT_W                       543
#define NOT_W                         544
#define nW                            545
#define RW                            546
#define nWRITE                        547
#define R                             548
#define W                             549
#define NOT_WRITE                     550
#define R_nW                          551
#define R_W                           552
#define START                         553
#define S                             554
#define STOP                          555
#define P                             556
#define A                             557
#define NOT_A                         558
#define nA                            559
#define D_A                           560
#define D_nA                          561
#define D                             562
#define DA                            563
#define D_NOT_A                       564
#define NOT_ADDRESS                   565
#define nADDRESS                      566
#define CKE                           567
#define SMP                           568
#define T2CON                         569
#define T2CKPS0                       570
#define T2CKPS                        571
#define T2CKPS1                       572
#define TMR2ON                        573
#define T2OUTPS0                      574
#define TOUTPS0                       575
#define TOUTPS                        576
#define T2OUTPS1                      577
#define TOUTPS1                       578
#define T2OUTPS2                      579
#define TOUTPS2                       580
#define T2OUTPS3                      581
#define TOUTPS3                       582
#define PR2                           583
#define WM0                           584
#define WM1                           585
#define WAIT0                         586
#define WAIT1                         587
#define EBDIS                         588
#define T1CON                         589
#define TMR1ON                        590
#define TMR1CS                        591
#define NOT_T1SYNC                    592
#define T1SYNC                        593
#define nT1SYNC                       594
#define T1OSCEN                       595
#define SOSCEN                        596
#define T1CKPS0                       597
#define T1CKPS                        598
#define T1CKPS1                       599
#define T1RUN                         600
#define T1CON_RD16                    601
#define T1RD16                        602
#define RCON                          603
#define BOR                           604
#define NOT_BOR                       605
#define nBOR                          606
#define POR                           607
#define nPOR                          608
#define NOT_POR                       609
#define PD                            610
#define nPD                           611
#define NOT_PD                        612
#define NOT_TO                        613
#define nTO                           614
#define TO                            615
#define nRI                           616
#define NOT_RI                        617
#define RI                            618
#define SBOREN                        619
#define IPEN                          620
#define WDTCON                        621
#define SWDTE                         622
#define SWDTEN                        623
#define HLVDCON                       624
#define HLVDL                         625
#define HLVDL0                        626
#define LVV0                          627
#define LVDL0                         628
#define HLVDL1                        629
#define LVDL1                         630
#define LVV1                          631
#define HLVDL2                        632
#define LVV2                          633
#define LVDL2                         634
#define HLVDL3                        635
#define LVV3                          636
#define LVDL3                         637
#define HLVDEN                        638
#define LVDEN                         639
#define BGST                          640
#define IRVST                         641
#define IVRST                         642
#define VDIRMAG                       643
#define OSCCON                        644
#define SCS0                          645
#define SCS                           646
#define SCS1                          647
#define FLTS                          648
#define IOFS                          649
#define OSTS                          650
#define IRCF                          651
#define IRCF0                         652
#define IRCF1                         653
#define IRCF2                         654
#define IDLEN                         655
#define T0CON                         656
#define T0PS                          657
#define T0PS0                         658
#define T0PS1                         659
#define T0PS2                         660
#define PSA                           661
#define T0SE                          662
#define T0CS                          663
#define T08BIT                        664
#define T016BIT                       665
#define TMR0ON                        666
#define STATUS                        667
#define C                             668
#define CARRY                         669
#define DC                            670
#define ZERO                          671
#define Z                             672
#define OV                            673
#define OVERFLOW                      674
#define N                             675
#define NEGATIVE                      676
#define INTCON3                       677
#define INT1IF                        678
#define INT1F                         679
#define INT2IF                        680
#define INT2F                         681
#define INT1E                         682
#define INT1IE                        683
#define INT2IE                        684
#define INT2E                         685
#define INT1P                         686
#define INT1IP                        687
#define INT2IP                        688
#define INT2P                         689
#define INTCON2                       690
#define RBIP                          691
#define TMR0IP                        692
#define INTEDG2                       693
#define INTEDG1                       694
#define INTEDG0                       695
#define RBPU                          696
#define NOT_RBPU                      697
#define nRBPU                         698
#define INTCON                        699
#define RBIF                          700
#define INT0F                         701
#define INT0IF                        702
#define T0IF                          703
#define TMR0IF                        704
#define RBIE                          705
#define INT0E                         706
#define INT0IE                        707
#define T0IE                          708
#define TMR0IE                        709
#define PEIE                          710
#define PEIE_GIEL                     711
#define GIEL                          712
#define GIE_GIEH                      713
#define GIE                           714
#define GIEH                          715
#define STKPTR0                       716
#define STKPTR                        717
#define SP0                           718
#define STKPTR1                       719
#define SP1                           720
#define STKPTR2                       721
#define SP2                           722
#define SP3                           723
#define STKPTR3                       724
#define STKPTR4                       725
#define SP4                           726
#define STKUNF                        727
#define STKOVF                        728
#define STKFUL                        729

#endif // _PIC18LF4525_H_
